{ 
"Managing Symptoms": [ 
			{
				"Tip": "Be Kind to Yourself. When you experience sensory overload, retire to a quiet place and take some mindful moments.",
				"FullPost": "Good morning my fellow dementia diarists, it’s me Agnes from Scotland preparing for the last event of the year. It’s at the Glasgow Film Festival theatre, they’re showing a Dementia Friendly Screening of White Christmas. It’s been fully booked over the last few weeks so it’s going to be challenging I’m sure, but fun. I’m on duty as a volunteer and an advisory member of the committee. I’m getting prepared, I’ve got my Santa hat out, I’ve got my Christmas cheer now let the show begin! Merry Christmas everybody and please remember be kind to yourself. Be aware that Christmas cheer is not for everyone and we can get sensory overload. So just retire- my spot seems to be the bathroom, the quietest place in the house- so that you can take some mindful moments, gather your thoughts, be grateful and go out and enjoy what you do. Take Care! Bye for now!" ,
				"Author": "Agnes Houston",
				"URL": "https://dementiadiaries.org/entry/6480/agnes-says-be-kind-to-yourself-this-christmas"
			},
			{
				"Tip": "It's ok to smile, laugh and even joke about yourself and your time with dementia. ",
				"FullPost":"Hi this is Dory. This is the 4th silly story of Christmas. It’s hard to think of which one to say because there’s that many of them but I’ll give you my adventures with the pushbike. I had a fold up pushbike, I’d gone to get my Christmas shop. We’re going back years, we didn’t have a car, so I used to go down to my local store on the bike. So off I go to get some of the Christmas shopping. I was coming back up a hill and I had a carrier bag on each handle full of tins and cans of beer, and all sorts. So I was peddling away up this hill and the bike suddenly folded in half. So off went the bags of shopping, the cans were rolling down the hill so I had to leave the bike on the side of the road, and run picking up my shopping. So I don’t know why it folded up, I think I hadn’t tightened the screw enough. So there was that incident, and some people came out of their houses to help me pick the shopping up. And the next incident with the bike, the same bike, I was biking home from Work one evening and the pedals fell off, the whole pedal, the steel bit as well. So I pushed it home, but it was late so, I sort of fixed it, but it was sort of dark so I couldn’t see properly what I’d done, and I was doing the early shift next morning. I got on the bike, but what I’d done, instead of the pedals going sort of alternative, the two pedals went round together, so I had to get to work, so I didn’t have time, so I’ll just go on it anyway, so I was just like… I looked a bit like a kangaroo, because I was pedalling both together. If you can imagine, it’s a bit difficult telling it, without being able to show what I mean. Think of a kangaroo going along the road, that was me. And quickly there was another one, where I was biking along again, and the seat started sort of just going down, so I ended up with the handlebars nearly above my head. So I got rid of the bike after that because I don’t think we really go together. I think I was born with dementia you know, because things are only going to get worse I think. Anyway, hope I’ve made you smile again and I’ll do the 5th one tomorrow. I bet you’re all fed up but only 2 more to go. Ok, Bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6483/dory-silly-story-for-christmas-number-4-and-encounters-with-a-bike"
			},
			{	
				"Tip":"Don't forget to destress after a long day or a more forgetful day.",
				"FullPost":"Hi, this is Dory. And I think we’re on the 5th day of the lead up to Christmas. I think I could do with a smile myself today, it’s been a bit of a horrendous day. So here we go then. When I was married and bringing up the children we didn’t have much money at all. My ex-husband was a bit, well a lot of a miserable man so we never went out to eat. So when I got divorced after 22 years, a friend, he was a male friend but we weren’t an item, as to say, invited me out for a meal over Christmas. So I accepted and we went for an Indian. As I said I hadn’t been out to eat for a meal, never mind an Indian meal, so I wasn’t quite sure what things were or what I would like. So I thought I’d just order what he orders. So I can’t exactly remember what it was we had, as it was a long time ago but the meal came and we had naan bread and I started eating my naan bread, cutting it with a knife and fork and he started grinning. So I said what’s the matter, so he said, “you’re the first person I’ve seen eating naan bread with a knife and fork”, so I felt really embarrassed. I was very shy and I had to wear glasses for distance and things but I didn’t put them on that night being a bit vain I suppose. So I thought when he said this about the naan bread I better watch how he eats his food from now on or I’m going to make more of a fool of myself. So I always waited on the other courses to see what he did and I would then I would sort of copy him. And then the waiter came and put a bowl on the table. Which looked to me, because everything was a bit blurred like coconut macaroons. So I thought I wonder how you’re supposed to get them out of the bowl and eat them. So I thought I ‘d let him do his first. Anyway he reached over to the bowl, picked one out and continued to wipe his face and his fingers with it. It was actually a hot flannel and I just thought to myself it’s a good job I waited to see what he did or I’d have ended up sticking them in my mouth. So anyway I hope that made you smile. As I said I’ve had a bit of a bad day with the shopping. I went to the old brewery today which was nice, but then after that I went to get the last of my shopping. And I forgot my purse, and when I got home I forgotten nearly everything. And so I had to go again. Anyway I’m now de stressing . So there you go, it’s the 6th one tomorrow. I hope you’re enjoying these little stories. I’ll have a write a book or make a television series. Ok speak to you tomorrow, bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6486/dorys-5th-silly-christmas-story-involving-a-near-miss-with-a-hot-flannel"
			},
			{
				"Tip":"It's ok to go from doing really well to forgetting some things, it's just part of the process.",
				"FullPost":"A day in the life of Dory – involving exploding red wine. Hi this is Dory and I must apologise as I know I gave the last of my silly stories after Christmas Eve, but I’ve just tried to open a bottle of wine and absolutely splattered my little flat with red wine. It was a corked one and I thought I’ll go and have a glass of red wine now but I hadn’t got a corkscrew, because they’re usually screw top now. After half an hour trying to get the cork out I sort of chipped away through half the cork and then I thought ooh I got a wooden spoon and put the handle of the spoon in and got a hammer and whacked the top of the spoon to try and push the cork in, which I succeeded in doing. But I have covered myself in red wine and it has gone all over the ceiling, all over the walls, everywhere. I hope it dries and you can’t see it otherwise I’m going to have to paint the ceiling. I’ve had a bit of a disaster today. My son’s been staying for Christmas and I did bacon and sausage and egg for breakfast, and he said “Mum you’re doing really well” but then after, I forgot to turn off the grill so the smoke alarm went off. Then later when I was washing up I turned on the tap in the sink and forgot and so I flooded the kitchen as well and now I’ve sprayed everywhere with red wine. Anyway I’m going to have some with bits of cork in. I will try not to do anymore silly things. I hope you’ve all had a lovely Christmas and wish you all the best for the New Year. Bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6537/a-day-in-the-life-of-dory-involving-exploding-red-wine"
			},
			{	
				"Tip":"When sensory overload happens its ok to retreat to a corner and regain some self dignity and composure.",
				"FullPost":"Annie talks about what Santa did and didn’t bring this Christmas Well santa didn’t visit me this year, but then I haven’t been particularly good. I’ve ruffled a few feathers in political circles, and I have shouted from the rooftops when I’ve seen injustices. Or it may be that santa has developed some form of dementia and forgot where I lived. Either way I’m not too fussed about not having any presents to open – Christmas is not just about gifts and food and prosecco. No, it’s about family and celebrating together. Well that’s what I’m led to believe. Trouble is not everyone is fortunate enough to have someone around them. There are a whole host of reasons Christmas can be a lonely time. Believe you me, even when surrounded by people laughing and enjoying the festivities, dementia can rob you of that sense of wellbeing. The wellbeing you’ve tried so hard to portray all year. Conversations are had to keep up with, when sensory issues are being pushed to the limit. And you can’t even chill out with a bottle of wine because the bloody medication has the upper hand! Retreat into a relatively quiet corner wanting to regain some dignity and composure but even here my mind goes into overdrive. I start to think of what the new year might bring, I wonder how much longer I will be able to drive, I imagine what route my dementia journey will take. Then in the distance I hear a voice – “wake up Annie, wake up Annie – santa’s been and you need to come and see what he’s brought.” I stumbled out of my slumber and out of my bed to discover a beautiful new outfit with instructions to wear it at the prepared Christmas dinner in 4 hours time. My work started to organise Christmas celebrations so that my stress levels aren’t raised to unbearable heights. There are invitations to visit people who I’ve met during the last year, the grandchildren have asked santa to remind me that they want me to go with them to the beach lots of times in the summer. And my dogs new bed is amazing. Okay so santa didn’t bring me the RAV 4 I had on my list, and he didn’t bring me a lovely new shell to replace the rubbish one. He didn’t send me a builder to stop the water coming in the front door, and he didn’t wave the magic wand to make the dementia disappear. But Ho ho ho for friends who have stuck by me and shown me they love me no matter how silly I behave. Yes I’ve got dementia, but dementia hasn’t got me.",
				"Author":"Annie", 
				"URL":"https://dementiadiaries.org/entry/6540/annie-talks-about-what-santa-did-and-didnt-bring-this-christmas"
			},
			{	
				"Tip":"Having a normal routine can help manage your stress level.",
				"FullPost":"Glenda has a stressful christmas: Hello happy new year to everybody, it’s Glenda here. It’s been a very stressful time over Christmas for all of us, I hope you all had a nice Christmas anyway, but I did find it very stressful. I’m just glad to get back to a normal routine now that everything’s over, and will be starting tomorrow by going to my usual DementiaGo class at the leisure centre. I hope everybody is ok and it wasn’t too stressful for us all. Bye – call again soon.",
				"Author":"Glenda Roberts",
				"URL":"https://dementiadiaries.org/entry/6544/glenda-had-a-stressful-christmas-and-is-looking-forward-to-getting-back-to-normal"
			},
			{	
				"Tip":"Remembering how to keep your normal routine can be hard, so just start by creating a new routine every day.",
				"FullPost":"Good morning everybody and happy Thursday January 4th. Life is getting back to what we would call our normal routine, although I must admit I can’t remember my normal routine so it’s like starting the New Year with a clean sheet and trying to sort my routine as the days go by – a bit challenging, exciting too but more challenging than exciting I must say. Anyway, today I’m going into Glasgow and meeting my friend Nancy who a lot of you know and we’re going off on a dementia adventure. Am I being silly doing this? Again there’s this apprehension in me: I’m hoping they see the true face of dementia and not just showing Nancy and I having fun because, yes Nancy and I have fun, sure we all do don’t we guys but behind it there’s apprehension, anxiety and how will we be and how we’re going to cope in a new. environment. I’m looking forward to seeing. Nancy and catching up with her but, as I say, my tummy has butterflies and I don’t know how this is going to plan out. I’ll keep you posted, bye for now. I need to go for my train.",
				"Author":"Agnes Houston",
				"URL":"https://dementiadiaries.org/entry/6547/agnes-wants-to-show-the-true-side-of-living-with-dementia-on-her-adventure-today"
			},
			{	
				"Tip":"Sometimes you just have to accept things to make your life easier.",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{	
				"Tip":"Inserting grab nails in the bathroom will help you to stabilize yourself. ",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{	
				"Tip":"Extra banisters on the stairs can help you get up the stairs when your tired. ",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{	
				"Tip":"Putting red tape on the bottom and top stairs can help you to see them and reduce falls.",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{	
				"Tip":"Put a motion sensor in your bathroom so you don't have to remember where the light is when you get up in the night.",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{	
				"Tip":"Add a blue light to your toilet to help you find it in the night. ",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{	
				"Tip":"Take an emergency nightlight everywhere you go overnight to combat the scary shadows you see as a result of dementia ",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{		
				"Tip":"Putting red stickers on smoke alarms can help you identify them when it's hard to see against a white background. ",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{	
				"Tip":"Get a perpetual calendar to help you remember the days. ",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{	
				"Tip":"Use an alarm to help you remember to drink often.",
				"FullPost":"Hello, it’s Tracey. Happy New Year to you. I just want to say that sometimes you have to do what’s easier for you when you have a condition. I’ve had to bite the bullet and accept things to get to live better, so I have special equipment in the house like grab rails in the bathroom and I have an extra bannister on the stairway because climbing the stairs is like climbing Mount Everest, especially when I’m tired. I have red tape at the top of the stairs and at the bottom because I can’t see them very well. It stops me from falling; if I see the red tape I know the stairs are there and the fire brigade have put red labels on my smoke alarms so I can see them to check them because I can’t see white on white very well. I have recently bought a motion-sensor light for the toilet so when I get up in the night I don’t have to put the bathroom light on. A blue light appears in the toilet: blue’s quite soothing on the eyes and I can’t take anything too bright, so that’s helped me. I dont like the dark at all now because of my dementia; I see shadows that aren’t there and it scares me, so I have a little lamp in my bedroom and I have an emergency night light which I take with me if I have to go away anywhere. My sister bought me a perpetual calendar which I change daily so. I know the date by looking at the month and the days and that helps me hugely; with not working anymore I forget the days. I have a special alarm that I use to help me drink as well; I place it on the cup and it alarms every 15 minutes and that helps to remind me to drink. I don’t know how to explain it but sometimes you just have to do and get these in to to live better and not end up in hospital because you’re dehydrated and confused, which I have a fear of really. Anyway, I hope that’s ok and I hope you have a lovely day and I’ll see you again soon. Bye!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6559/tracey-gives-some-great-tips-about-equipment-and-changes-to-enable-at-home"
			},
			{	
				"Tip":"It's hard to keep a clean house when you have dementia its good to get outside help cleaning. ",
				"FullPost":"This is Shelagh Robinson, not only not coping with Christmas but not coping with after Christmas. Everywhere’s chaotic, I can’t find the cases for these things, putting things away is just not happening because I can’t concentrate on it. I’ve never liked Christmas basically, it’s always brought bad memories of unhappy Christmases and there have always been some tears for me at Christmas, but this has been really awful and looking around me at the apartment and the state it’s in, I’m reminded so firmly about the people I care about with dementia who became gradually not able to cope with keeping their home in the way it should be kept. Paul (?) can help an awful lot , but he’s not as capable as he was and my cleaner who comes fairly regularly because she isn’t well and isn’t keeping on top of it. So I’m starting the new year feeling terribly blue. But at least I’ve managed to tidy up a couple of my desk drawers, so my desk looks ok at least but I feel that I’m fighting a real losing battle with the effects of dementia, and the effects dementia is having on my home. So this is rather a sad new year, dementia diaries. Happy new year everybody.",
				"Author":"Shelagh Robinson",
				"URL":"https://dementiadiaries.org/entry/6586/shelagh-starting-the-new-year-feeling-terribly-blue-and-coping-with-the-post-christmas-chaos"
			},
			{	
				"Tip":"Slowing down in life is not a weakness and can actually help you enjoy life more, and it helps with symptoms of dimensia.",
				"FullPost":"Hello again it’s George here, happy new year everybody. Err that should have sounded a bit more enthusiastic – HAPPY NEW YEAR EVERYBODY! That’s better. I’ve been reflecting recently. I’ve often written about not liking being told to take things easy, to calm down, do less, don’t get tired – and I’ve sort of rebelled against that on the basis that I wanted to keep active, it was what makes life worth living etc etc. But in fact, just over Christmas because I’ve had 2 weeks doing very little other than family stuff; in fact I had family for 3 and a half 4 days, just after Christmas which was great. My children who are now well grown up did most of the cooking and stuff so I actually was kept out of the kitchen a lot, which is probably a good thing, but I wasn’t looking forward to it. But actually I now feel quite a bit better because I’ve done so little and I’m just concentrating more on odds and ends at home. I’m going to go out in the garden in a little bit to catch up and I was thinking the other night; I thought actually – yeah I do need to withdraw a little bit – not completely, but just do less because physically I get less tired then and the little symptoms that I have, the dementia related symptoms, seem to reduce. So I don’t know, whether it’s just a phase? or whether it’s to do with being tired too often? Certainly one or two people were saying at the end of last year that I was looking tired and I was grumpy and I was at times at home, maybe not in public but certainly at home. So I think maybe there is something in not getting to tired, and just limiting for me anyway, limiting what I do and withdrawing from one or two things that or less important, and that actually I can’t even influence anyway – that doesn’t mean that I’m withdrawing everything to do with dementia but it does suddenly mean that I’m going to withdraw a bit from some of the other stuff to do with health care generally and patient involvement. Anyway I just thought I would share that. As it is, I am going to get out in the garden in a little bit and get some fresh air. So take care of yourselves, I’ll speak to you again soon. Bye.",
				"Author":"George Rook",
				"URL":"https://dementiadiaries.org/entry/6595/george-says-that-actually-slowing-down-over-christmas-has-been-quite-good-for-him"
			},
			{	
				"Tip":"Silence help some people calm down because even quiet music can irritate the brain.",
				"FullPost":"Hello it’s Tracey, hope you’re ok, I want to talk about music really. I used to love listening to music, absolutely love it and stuff. If I used to drive to work or anywhere, a CD used to go in, all the time music as background at home and all that sort ofmalarky. Unfortunately I don’t, I can’t. Music even noise irritates my brain, my dementia. So I like complete and utter silence most of the time. It’s easier for my brain to have that and I do get fed up with listening to people saying what I should be doing when actually we all know that dementia is individual to that person unless they’re right and they go wrong. I don’t have background noise now; I have complete and utter silence. Most of the time because I’m so busy if I am busy being with people for a couple of hours and then I need the break of complete silence. I might be doing something or whatever but I can’t have background noise any more. I do like listening to music I’ve still got CD’s and I have Spotify on my phone which I’ve never had before, that’s quite nice. I was in my conservatory yesterday and had my Spotify on my phone going very softly in the background; I coped with that quite well. It wasn’t too much noise and I was focusing on something else but most of the time I have to have a lot of silence in the background. I know people don’t understand that, they think it helps the brain and you have to listen to it all the time. Well I don’t have to do anything, I don’t think nobody does. I just wish people would remember that we’re all different. I put something on Twitter about music and some people came back and said well you have to do this and you have to do that. I said no I don’t have to do anything because we’re all different with our perception of things and I just think they need to be aware maybe of how we are maybe and how dementia affects us in different ways. Anyway, hope you have a good day. Bye now!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6598/tracey-used-to-love-listening-to-music-but-now-finds-that-it-irritates-her-brain"
			},
			{	
				"Tip":"It's good to try to learn and do new things even if you don't know if it will work. Routines are helpful",
				"FullPost":"Glenda is off to learn how to play the Ukulele today! Hi! It’s Glenda here, just wishing everybody a happy new year, and I’m going to get back to my old routine which really is starting today. This afternoon I am going to learn a new skill, I am going to start learning how to play the ukulele, hopefully I will remember it. After that I will go to DementiaGo class which is an exercise for people with dementia. That’s it for today, I’ll call soon. Bye!",
				"Author":"Glenda Roberts",
				"URL":"https://dementiadiaries.org/entry/6628/glenda-is-off-to-learn-how-to-play-the-ukulele-today"
			},
			{	
				"Tip":"Business can have a corrosive effect on dementia treatment",
				"FulPost":"Hi this is Dory, and I’d just like to make a report about how I’m feeling about Dementia Friends. You may know that I am a Dementia Friends Champion and it was during one of the Dementia Friends sessions that I got involved with Peer Support and got involved in other projects such as DEEP and Dementia Diaries. I’m not saying that the Dementia Friends Awareness and the Dementia Friendly Communities are not a good thing but I think personally it’s got a bit competative. Who makes the most Dementia Friends and this sort of thing and it’s more of the business I think. I like the theory of it, it does do a lot of good, but I think they’re forgetting its going off the reality of it, or what it should be about. It’s getting more of the business instead of actually caring. There are a lot of people that do it for a good purpose but then I think it’s got very competative and just so business like. That’s my feeling anyway. Ok bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6707/dory-has-concerns-about-dementia-friends"
			},
			{	
				"Tip":"Many issues are not talked about and should be",
				"FulPost":"Hello this is Shelagh Robinson, I want to talk about something that we don’t normally talk about, I want to talk about incontinence I think there is stereo typical view of this is, that it’s something that happens in the very late stages of dementia, but I know from my contacts where so many people who have dementia that this isn’t true, there are many people like me who are told with incontinence, that it is dementia related from very early on in their illness, I have always been able to manage it perfectly well, its not been a problem unless I have been stuck on a train, on a very crowded train and I couldn’t get to make myself comfortable. but now I am finding that it’s a huge problem because what I am forgetting to do is to change regularly, I cannot use it as far as i can by asking people that I am not embarrassed to ask to remind to go and change ,but sadly, except for the wonderful Jayne Roberts, most people forget its seriously becoming a problem to me and I wonder if anybody else has the same difficulty? I would love to hear from you if you do.",
				"Author":"Shelagh Robinson",
				"URL":"https://dementiadiaries.org/entry/6843/shelagh-would-like-to-hear-from-other-people-about-incontinence-and-how-do-you-remember-to-change-your-pad"
			}
		]	
}
{		
"Relationships": [		
			{
				"Tips":"The friends and family who stick by you even through dementia are the greatest gift you can ask for. ",
				"FullPost":"Annie talks about what Santa did and didn’t bring this Christmas Well santa didn’t visit me this year, but then I haven’t been particularly good. I’ve ruffled a few feathers in political circles, and I have shouted from the rooftops when I’ve seen injustices. Or it may be that santa has developed some form of dementia and forgot where I lived. Either way I’m not too fussed about not having any presents to open – Christmas is not just about gifts and food and prosecco. No, it’s about family and celebrating together. Well that’s what I’m led to believe. Trouble is not everyone is fortunate enough to have someone around them. There are a whole host of reasons Christmas can be a lonely time. Believe you me, even when surrounded by people laughing and enjoying the festivities, dementia can rob you of that sense of wellbeing. The wellbeing you’ve tried so hard to portray all year. Conversations are had to keep up with, when sensory issues are being pushed to the limit. And you can’t even chill out with a bottle of wine because the bloody medication has the upper hand! Retreat into a relatively quiet corner wanting to regain some dignity and composure but even here my mind goes into overdrive. I start to think of what the new year might bring, I wonder how much longer I will be able to drive, I imagine what route my dementia journey will take. Then in the distance I hear a voice – “wake up Annie, wake up Annie – santa’s been and you need to come and see what he’s brought.” I stumbled out of my slumber and out of my bed to discover a beautiful new outfit with instructions to wear it at the prepared Christmas dinner in 4 hours time. My work started to organise Christmas celebrations so that my stress levels aren’t raised to unbearable heights. There are invitations to visit people who I’ve met during the last year, the grandchildren have asked santa to remind me that they want me to go with them to the beach lots of times in the summer. And my dogs new bed is amazing. Okay so santa didn’t bring me the RAV 4 I had on my list, and he didn’t bring me a lovely new shell to replace the rubbish one. He didn’t send me a builder to stop the water coming in the front door, and he didn’t wave the magic wand to make the dementia disappear. But Ho ho ho for friends who have stuck by me and shown me they love me no matter how silly I behave. Yes I’ve got dementia, but dementia hasn’t got me.",
				"Author":"Annie",
				"URL":"https://dementiadiaries.org/entry/6540/annie-talks-about-what-santa-did-and-didnt-bring-this-christmas"
			},
			{
				"Tip":"Sometimes it takes the help of someone else to show us all we can still be even with our dementia. ",	
				"FullPost":"Agnes says ‘I needed help to be all I could be’ Hi everybody it’s Monday afternoon January 8th. Here’s some feedback from my Adventures with Dementias with my friend Nancy. We travelled by car to the Calvert Centre in Kielder in Northumberland. Now I’m having balance and walking issues, so Nancy was talking about doing zip slides and all sorts of adventures. But there was no way I could do these things, no way I could accompany Nancy. So I said that I would definitely watch but I also knew that because of my issues, I asked if I could have Aimee to come with us. Now Aimee is from Dementia Adventures Holidays, she has got great understanding, knowledge and skills in dementia and I knew that I would need this as I had been through quite a challenging year and I was at an all time low. And alongside Nancy’s peer support, how could I fail but to have a fantastic time. But not only did I enjoy the company, not only did I have a fantastic time but I, yes, I did finish a zip ride. Not only once but twice, so who would have thought. I realised that I needed this help, I needed to be shown how I can be all I can be. I read about all of these, and it’s easy to say “be all you can be” but I realised I needed help to do this and I received that help at the Calvert Centre. It wasn’t one thing, it was an accumulation of many things. Aimee’s support and knowledge, Nancy’s peer support, good environment, good signage, great people who were doing the adventures. They built me up when I’d been put down by many things in 2017. Now I am walking towards 2018, my glass has been filled up and then I listened to Dementia Diaries this morning. Thanks everyone for listening to Dementia Diaries, thanks everybody for what they do for dementia. And I’m looking forward to 2018. Today, well today I’ve spent all day in bed. I can’t believe it’s ten to four in the afternoon. This is the price I pay to do these things, but it’s been so worth it. Yes thank you for listening, bye.",
				"Author":"Agnes Houston",
				"URL":"https://dementiadiaries.org/entry/6609/agnes-says-i-needed-help-to-be-all-i-could-be"
			},
			{
				"Tips":"On days when you feel your glass is half empty, rely on your friends to fill you back up. ",
				"FullPost":"Annie talks about what to do on those ‘Glass half empty days’ Hi there it’s Annie. What does one do when you wake up in the morning and it feels like your glass is half empty rather than half full? I suppose an option would be to turn the glass upside down and try to carry on regardless. No guarantee that this will work mind you. Or you could throw the glass in the bin and go back to bed – very tempting. Perhaps you could empty the glass, refill it and start over again; not a bad idea – if you’ve got the energy and motivation. On days like these I really rely on my friends I ask them if they fancy exchanging my unpredictable glass for a mug. A mug of comforting chocolate. A good friend will recognise my predicament and where possible stop me from throwing my jolly glass at the wall even offering to add marshmallows to my chocolate. If you don’t like chocolate just enjoy the marshmallows. Thank you.",
				"Author":"Annie",
				"URL":"https://dementiadiaries.org/entry/6580/annie-talks-about-what-to-do-on-those-glass-half-empty-days"
			},
			{
				"Tips":"Be grateful for the time that you have with your loved ones.",
				"FullPost":"Hello it’s Melvyn here. It is now half past 11 at night and I want you to listen to this……………………….. did you hear it? Silence. That’s what’s in my house, without my darling wife. So (???). I cannot hear her cannot breath her cannot smell her cannot touch her. I will not ever see her again. I have loved her. I have caressed her. And I am happy that I did. I am privileged to have known her. Privileged to have married her. And to have looked after her. I don’t know how long it’s going to be before before I can express my love and I don’t know. My Alzheimer’s is getting worse. My dementia’s getting worse. All what it must’be been like for my wife, knowing that my brain is going and how she would’ve coped with it. So perhaps in that instance it’s better that this way. Because she hasn’t got the pain of me maybe the pain of her disabilities. (???) 2018 in (???) so let’s hope it’s a better 2018 and let’s hope we find a cure for dementia and start to be able to enjoy that thought. I’m here on the settee with my dogs by the fire, aren’t we? (???) so that so perhaps we should all be lucky or perhaps I should be lucky for just for that. Who knows? Who cares? No love, no compassion, no care.",
				"Author":"Melvyn Brooks",
				"URL":"https://dementiadiaries.org/entry/6553/melvyn-it-is-half-past-11-at-night-and-i-want-you-to-listen-to-this-silence"
			},
			{
				"Tip":"Asking for help from loved ones is completely acceptable and can help take the pressure off of you.",	
				"FullPost":"Hi it’s Carol with my diary for 20th December 2017. I have some more to say on Christmas followed by a more light hearted talk, which is slightly funny. Inside I’m panicking, deep inside, in the pit of my stomach. I feel like screaming. I want to hibernate until this year is over. I’ve wrapped all the presents I’ve bought for people, but I still have to get a few more bits. Bits I’ve forgotten. Or maybe not even thought of. How do you get everything when you don’t know what everything is. I’m finding Christmas so difficult this year. My head is in such a muddle. I feel like an over dressed Christmas tree. All lights and tinsel. I look ok on the outside but the inside is a mess. It like my brain is a completed puzzle that has been lifted up and thrown high up into the air. I see it floating down, slowly, each piece becoming jumbled up, before landing in a heap on a table. I don’t know if I’ve thought of everything. Hubby is doing his best to help but he has never been involved, in the run up to Christmas, and still thinks it comes from Santa Claus or fairies. So he knows even less than me. I think next year he will, maybe, have to take over from me. I feel like my dementia has taken a roll down a vast hill lately. I’m hoping that once Christmas is over that my head will clear and I will get back to how I was before. I’m sure I will. On another note, and to end on a positive, I would like to talk about our weight chart which we hang on the inside of the airing cupboard door. For years now we have both been closely watching our weight. We each have a summer weight and a winter weight. I weighed myself the other morning and put it on the chart, as did Brian. I removed the chart this morning, as it was now full and I took it downstairs to print out a new chart for 2018. Brian, Love him, then pointed out, that the chart was all over the place and in a muddle. He showed me the weekly dates, which were definitely not consecutive by a long shot. I had to laugh. I hadn’t even noticed. I just hopped on the scales and put my weight in the next box. Don’t know what happened but it’s all wrong. In the new year I now have to do a complete a new graph and hopefully get it correct. Either that or forget about the whole weight thing and become dipsy, the tele tubby! There will be no further Diaries from me, until 2018. All that’s left to say is I wish you all a very merry Christmas and a happy, healthy and prosperous new year from myself and hubby. Take care and stay safe. Bye for now.",
				"Author":"Carol Fordyce",				"URL":"https://dementiadiaries.org/entry/6445/carol-says-i-hope-that-once-christmas-is-over-i-will-get-back-to-where-i-was-before"
			},
			{
				"Tip":"Sometimes you have to accept the things you can no longer do, like keeping track of your weight. ",	
				"FullPost":"Hi it’s Carol with my diary for 20th December 2017. I have some more to say on Christmas followed by a more light hearted talk, which is slightly funny. Inside I’m panicking, deep inside, in the pit of my stomach. I feel like screaming. I want to hibernate until this year is over. I’ve wrapped all the presents I’ve bought for people, but I still have to get a few more bits. Bits I’ve forgotten. Or maybe not even thought of. How do you get everything when you don’t know what everything is. I’m finding Christmas so difficult this year. My head is in such a muddle. I feel like an over dressed Christmas tree. All lights and tinsel. I look ok on the outside but the inside is a mess. It like my brain is a completed puzzle that has been lifted up and thrown high up into the air. I see it floating down, slowly, each piece becoming jumbled up, before landing in a heap on a table. I don’t know if I’ve thought of everything. Hubby is doing his best to help but he has never been involved, in the run up to Christmas, and still thinks it comes from Santa Claus or fairies. So he knows even less than me. I think next year he will, maybe, have to take over from me. I feel like my dementia has taken a roll down a vast hill lately. I’m hoping that once Christmas is over that my head will clear and I will get back to how I was before. I’m sure I will. On another note, and to end on a positive, I would like to talk about our weight chart which we hang on the inside of the airing cupboard door. For years now we have both been closely watching our weight. We each have a summer weight and a winter weight. I weighed myself the other morning and put it on the chart, as did Brian. I removed the chart this morning, as it was now full and I took it downstairs to print out a new chart for 2018. Brian, Love him, then pointed out, that the chart was all over the place and in a muddle. He showed me the weekly dates, which were definitely not consecutive by a long shot. I had to laugh. I hadn’t even noticed. I just hopped on the scales and put my weight in the next box. Don’t know what happened but it’s all wrong. In the new year I now have to do a complete a new graph and hopefully get it correct. Either that or forget about the whole weight thing and become dipsy, the tele tubby! There will be no further Diaries from me, until 2018. All that’s left to say is I wish you all a very merry Christmas and a happy, healthy and prosperous new year from myself and hubby. Take care and stay safe. Bye for now.",
				"Author":"Carol Fordyce",    "URL":"https://dementiadiaries.org/entry/6445/carol-says-i-hope-that-once-christmas-is-over-i-will-get-back-to-where-i-was-before"
			},
			{
				"Tip":"Sometimes it takes the help of someone else to show us all we can still be even with our dementia.",	
				"FullPost":"Agnes says ‘I needed help to be all I could be’ Hi everybody it’s Monday afternoon January 8th. Here’s some feedback from my Adventures with Dementias with my friend Nancy. We travelled by car to the Calvert Centre in Kielder in Northumberland. Now I’m having balance and walking issues, so Nancy was talking about doing zip slides and all sorts of adventures. But there was no way I could do these things, no way I could accompany Nancy. So I said that I would definitely watch but I also knew that because of my issues, I asked if I could have Aimee to come with us. Now Aimee is from Dementia Adventures Holidays, she has got great understanding, knowledge and skills in dementia and I knew that I would need this as I had been through quite a challenging year and I was at an all time low. And alongside Nancy’s peer support, how could I fail but to have a fantastic time. But not only did I enjoy the company, not only did I have a fantastic time but I, yes, I did finish a zip ride. Not only once but twice, so who would have thought. I realised that I needed this help, I needed to be shown how I can be all I can be. I read about all of these, and it’s easy to say “be all you can be” but I realised I needed help to do this and I received that help at the Calvert Centre. It wasn’t one thing, it was an accumulation of many things. Aimee’s support and knowledge, Nancy’s peer support, good environment, good signage, great people who were doing the adventures. They built me up when I’d been put down by many things in 2017. Now I am walking towards 2018, my glass has been filled up and then I listened to Dementia Diaries this morning. Thanks everyone for listening to Dementia Diaries, thanks everybody for what they do for dementia. And I’m looking forward to 2018. Today, well today I’ve spent all day in bed. I can’t believe it’s ten to four in the afternoon. This is the price I pay to do these things, but it’s been so worth it. Yes thank you for listening, bye.",
				"Author":"Agnes Houston",
                "URL":"https://dementiadiaries.org/entry/6609/agnes-says-i-needed-help-to-be-all-i-could-be"
			}			
		]	
}
{
"Advocacy": [
			{
				"Tips":"Promote joint decision making, not substitute decision making, in order to ascertain the will and preference of people with dementia.",
				"FullPost":"A phrase like ‘dementia friendly’, while apparently positive, could be considered patronizing and inappropriate. The implication is that the solution to the problem is for people without dementia to be kind and considerate and welcoming of people with dementia. But if part of the problem is socially-imposed barriers, devaluing and even human rights violations, then the term ‘friendly’ might be judged an inappropriate response which would not used for other minorities Do we want ‘dementia friendly’ communities; or ‘dementia enabling communities’? We don’t just need ‘dementia friends’, we need ‘dementia allies’. Once you understand that social attitudes and social environments are often oppressive to people with dementia, perhaps you can begin to understand how some of the behaviours of people affected with dementia might be a reaction both being in the presence of a severe degenerative disability, but also to being socially excluded, infantilized and disempowered. Dementia advocate Kate Swaffer talks about ‘prescribed disengagement’, the way that as soon as someone gets a diagnosis, they are advised to stop work, hand in their driving licence, and prepare for an early death. Once someone has the diagnosis we can be treated like a medieval leper, often shunned by friends and colleagues. By reforming our environment and the way we are treated as people, perhaps we would maintain functioning for longer. Promoting joint decision making, not substitute decision making, would do better at ascertaining the will and preference of people with dementia. This will remove the barriers that stop people with dementia and their supporters from participating in community life” This is best done by asking us not what you can do for us, but how we can work together, by engaging with us and recognising us as contributing members of society. Can we truly say we are a dementia-friendly society without empowering people living with dementia and their friends and supporters? We have established dementia is a disability; it is covered by disability discrimination legislation. At the domestic level, that means the Equality Act, and at the international level, the equivalent is the Convention on the Rights of Persons with Disabilities (CRPD). Both these laws talk about reasonable adaptations that can be made to ensure that people with dementia or other disabilities are included, not excluded. Steve Milton Director of Innovations in Dementia says “We found that the phrase “dementia-friendly communities” (DFCs) means different things to different people; the word dementia is not used in some countries and others consider the word friendly to be patronising. Finding a definition that takes into account all of the views was not easy, but on reflection we can propose: In a DFC, people with dementia are included and respected. Citizens, organisations and businesses work together to ensure better access and engagement in their environment “ I’ve often thought why the ‘big guns’ never admit they’re wrong. Mark Twain was right with his observation, I feel. “It’s easier to fool people than convince them they’ve been fooled “ But it does mean people who know a thing or two about dementia have to stick their neck above the parapet, even if they’re deliberately excluded from conferences or undermined by people with long titles. My gut instinct is that we will get to know whether as a society whether it’s possible to ‘half believe’ in dementia friendliness by the actual behaviour of society. This will be very difficult to ascertain, but we will need to look into this. One thing’s for sure, it won’t be easily determined by the abundance of stickers promoting ‘awareness’. “It is better to stand in the dark with a friend, than stand alone in the light” Helen Keller",
				"Author":"Nigel Hullah",
				"URL":"https://dementiadiaries.org/entry/6409/it-is-better-to-stand-in-the-dark-with-a-friend-than-stand-alone-in-the-light"
			},
			{
				"Tips":"Dementia Friendly societies are those that empower people living with dementia. ",
				"FullPost":"A phrase like ‘dementia friendly’, while apparently positive, could be considered patronizing and inappropriate. The implication is that the solution to the problem is for people without dementia to be kind and considerate and welcoming of people with dementia. But if part of the problem is socially-imposed barriers, devaluing and even human rights violations, then the term ‘friendly’ might be judged an inappropriate response which would not used for other minorities Do we want ‘dementia friendly’ communities; or ‘dementia enabling communities’? We don’t just need ‘dementia friends’, we need ‘dementia allies’. Once you understand that social attitudes and social environments are often oppressive to people with dementia, perhaps you can begin to understand how some of the behaviours of people affected with dementia might be a reaction both being in the presence of a severe degenerative disability, but also to being socially excluded, infantilized and disempowered. Dementia advocate Kate Swaffer talks about ‘prescribed disengagement’, the way that as soon as someone gets a diagnosis, they are advised to stop work, hand in their driving licence, and prepare for an early death. Once someone has the diagnosis we can be treated like a medieval leper, often shunned by friends and colleagues. By reforming our environment and the way we are treated as people, perhaps we would maintain functioning for longer. Promoting joint decision making, not substitute decision making, would do better at ascertaining the will and preference of people with dementia. This will remove the barriers that stop people with dementia and their supporters from participating in community life” This is best done by asking us not what you can do for us, but how we can work together, by engaging with us and recognising us as contributing members of society. Can we truly say we are a dementia-friendly society without empowering people living with dementia and their friends and supporters? We have established dementia is a disability; it is covered by disability discrimination legislation. At the domestic level, that means the Equality Act, and at the international level, the equivalent is the Convention on the Rights of Persons with Disabilities (CRPD). Both these laws talk about reasonable adaptations that can be made to ensure that people with dementia or other disabilities are included, not excluded. Steve Milton Director of Innovations in Dementia says “We found that the phrase “dementia-friendly communities” (DFCs) means different things to different people; the word dementia is not used in some countries and others consider the word friendly to be patronising. Finding a definition that takes into account all of the views was not easy, but on reflection we can propose: In a DFC, people with dementia are included and respected. Citizens, organisations and businesses work together to ensure better access and engagement in their environment “ I’ve often thought why the ‘big guns’ never admit they’re wrong. Mark Twain was right with his observation, I feel. “It’s easier to fool people than convince them they’ve been fooled “ But it does mean people who know a thing or two about dementia have to stick their neck above the parapet, even if they’re deliberately excluded from conferences or undermined by people with long titles. My gut instinct is that we will get to know whether as a society whether it’s possible to ‘half believe’ in dementia friendliness by the actual behaviour of society. This will be very difficult to ascertain, but we will need to look into this. One thing’s for sure, it won’t be easily determined by the abundance of stickers promoting ‘awareness’. “It is better to stand in the dark with a friend, than stand alone in the light” Helen Keller",
				"Author":"Nigel Hullah",
				"URL":"https://dementiadiaries.org/entry/6409/it-is-better-to-stand-in-the-dark-with-a-friend-than-stand-alone-in-the-light"
			},
			{
				"Tips":"The facilities and support that other illnesses have, are becoming available and being created for people with dementia too.",
				"FullPost":"Hi, Just John here [inaudible]just me here now, I’ve been thinking what a year it has been for us all; people that have been diagnosed with, with dementia but I’m also thinking how people potentially have somewhere else to turn to when they’re diagnosed with dementia and people are when they’re diagnosed with cancer but people with dementia hasn’t really got the facilities that people with cancer has. And, I’m wondering how we can fit this? I think, I think that you’re coming soon, someone’s coming soon, um, coming shortly to see us and I’m looking forward to that. Hope to see you soon. Bye-Bye.",
				"Author":"John McErlane",
				"URL":"https://dementiadiaries.org/entry/6583/john-asks-why-we-dont-get-the-same-support-after-a-diagnosis-of-dementia-as-those-with-cancer"
			},
			{
				"Tips":"People with dementia still have the capacity to be artistic. ",
				"FullPost":"JANUARY IS HERE…… January is here, and Christmas is done The magic was good but not all was fun The family were great and the food delightful But the planning was hell and for me so frightful. January is here, and the new year begins With rain and cold, and all those strong winds When will it stop, not yet I’ve no doubt But spring will come and we can sit out. January is here, shops have sales, but their not for me! I have all I need, a hubby, a dog and a warm cup of tea A nice warm wood stove, with that bright red glow I’ll stay at home and wish for no snow. January is here, the shortest day may have past But the days are still short, and the nights are so vast So there’s time to read and there’s time to write Until the sun comes back and makes my world bright. January is here, with those terrible winter blues Heavy winter coats and the warmest of shoes Woolly hats, scarfs and gloves, weigh me down Whether I’m walking in the woods or in the town January is still here, when will it end Three more weeks, it’s driving me round the bend Then February will be here, with only 28 days Following that it’s March…and Spring is on its way. January is here, is it the same for you Are you experiencing these thoughts too Then let’s all wish as hard as we may That summer will come very soon one day.",
				"Author":"Carol Fordyce",
				"URL":"https://dementiadiaries.org/entry/6592/carols-poem-january-is-here"
			},
			{
				"Tip":"Don't use the term 'dementia friendly', while apparently positive, it could be considered patronizing and inappropriate.",
				"FullPost":"A phrase like ‘dementia friendly’, while apparently positive, could be considered patronizing and inappropriate. The implication is that the solution to the problem is for people without dementia to be kind and considerate and welcoming of people with dementia. But if part of the problem is socially-imposed barriers, devaluing and even human rights violations, then the term ‘friendly’ might be judged an inappropriate response which would not used for other minorities Do we want ‘dementia friendly’ communities; or ‘dementia enabling communities’? We don’t just need ‘dementia friends’, we need ‘dementia allies’. Once you understand that social attitudes and social environments are often oppressive to people with dementia, perhaps you can begin to understand how some of the behaviours of people affected with dementia might be a reaction both being in the presence of a severe degenerative disability, but also to being socially excluded, infantilized and disempowered. Dementia advocate Kate Swaffer talks about ‘prescribed disengagement’, the way that as soon as someone gets a diagnosis, they are advised to stop work, hand in their driving licence, and prepare for an early death. Once someone has the diagnosis we can be treated like a medieval leper, often shunned by friends and colleagues. By reforming our environment and the way we are treated as people, perhaps we would maintain functioning for longer. Promoting joint decision making, not substitute decision making, would do better at ascertaining the will and preference of people with dementia. This will remove the barriers that stop people with dementia and their supporters from participating in community life” This is best done by asking us not what you can do for us, but how we can work together, by engaging with us and recognising us as contributing members of society. Can we truly say we are a dementia-friendly society without empowering people living with dementia and their friends and supporters? We have established dementia is a disability; it is covered by disability discrimination legislation. At the domestic level, that means the Equality Act, and at the international level, the equivalent is the Convention on the Rights of Persons with Disabilities (CRPD). Both these laws talk about reasonable adaptations that can be made to ensure that people with dementia or other disabilities are included, not excluded. Steve Milton Director of Innovations in Dementia says “We found that the phrase “dementia-friendly communities” (DFCs) means different things to different people; the word dementia is not used in some countries and others consider the word friendly to be patronising. Finding a definition that takes into account all of the views was not easy, but on reflection we can propose: In a DFC, people with dementia are included and respected. Citizens, organisations and businesses work together to ensure better access and engagement in their environment “ I’ve often thought why the ‘big guns’ never admit they’re wrong. Mark Twain was right with his observation, I feel. “It’s easier to fool people than convince them they’ve been fooled “ But it does mean people who know a thing or two about dementia have to stick their neck above the parapet, even if they’re deliberately excluded from conferences or undermined by people with long titles. My gut instinct is that we will get to know whether as a society whether it’s possible to ‘half believe’ in dementia friendliness by the actual behaviour of society. This will be very difficult to ascertain, but we will need to look into this. One thing’s for sure, it won’t be easily determined by the abundance of stickers promoting ‘awareness’. “It is better to stand in the dark with a friend, than stand alone in the light” Helen Keller",
				"Author":"Nigel Hullah",
				"URL":"https://dementiadiaries.org/entry/6409/it-is-better-to-stand-in-the-dark-with-a-friend-than-stand-alone-in-the-light"
			},
			{
				"Tip":"Prioritize people effected by dementia rather than just a detached clinical perspective",	
				"FullPost":"Hi, this is Karen Kitch. I have been in a meeting for the last hour and a half, to people about story telling around the (Social and Wellbeing Act, Wales) Act agenda. There was a lot of people there from Social Services pride from story telling academic people, research people. I was the only person with dementia in the room. It just sounded like a room full of people talking about themselves, there was no feeling of anything being a way forward and they were saying there was people who told their stories, but they didn’t have them present so nobody knows if it benefited them or not.",
				"Author":"Karen Kitch",
				"URL":"https://dementiadiaries.org/entry/6839/karen-is-concerned-about-a-meeting-about-story-telling-with-none-of-the-story-tellers-there"
			},
			{
				"Tip":"Ask us not what you can do for us, but how we can work together, by engaging with us and recognising us as contributing members of society. ",	
				"FullPost":"A phrase like ‘dementia friendly’, while apparently positive, could be considered patronizing and inappropriate. The implication is that the solution to the problem is for people without dementia to be kind and considerate and welcoming of people with dementia. But if part of the problem is socially-imposed barriers, devaluing and even human rights violations, then the term ‘friendly’ might be judged an inappropriate response which would not used for other minorities Do we want ‘dementia friendly’ communities; or ‘dementia enabling communities’? We don’t just need ‘dementia friends’, we need ‘dementia allies’. Once you understand that social attitudes and social environments are often oppressive to people with dementia, perhaps you can begin to understand how some of the behaviours of people affected with dementia might be a reaction both being in the presence of a severe degenerative disability, but also to being socially excluded, infantilized and disempowered. Dementia advocate Kate Swaffer talks about ‘prescribed disengagement’, the way that as soon as someone gets a diagnosis, they are advised to stop work, hand in their driving licence, and prepare for an early death. Once someone has the diagnosis we can be treated like a medieval leper, often shunned by friends and colleagues. By reforming our environment and the way we are treated as people, perhaps we would maintain functioning for longer. Promoting joint decision making, not substitute decision making, would do better at ascertaining the will and preference of people with dementia. This will remove the barriers that stop people with dementia and their supporters from participating in community life” This is best done by asking us not what you can do for us, but how we can work together, by engaging with us and recognising us as contributing members of society. Can we truly say we are a dementia-friendly society without empowering people living with dementia and their friends and supporters? We have established dementia is a disability; it is covered by disability discrimination legislation. At the domestic level, that means the Equality Act, and at the international level, the equivalent is the Convention on the Rights of Persons with Disabilities (CRPD). Both these laws talk about reasonable adaptations that can be made to ensure that people with dementia or other disabilities are included, not excluded. Steve Milton Director of Innovations in Dementia says “We found that the phrase “dementia-friendly communities” (DFCs) means different things to different people; the word dementia is not used in some countries and others consider the word friendly to be patronising. Finding a definition that takes into account all of the views was not easy, but on reflection we can propose: In a DFC, people with dementia are included and respected. Citizens, organisations and businesses work together to ensure better access and engagement in their environment “ I’ve often thought why the ‘big guns’ never admit they’re wrong. Mark Twain was right with his observation, I feel. “It’s easier to fool people than convince them they’ve been fooled “ But it does mean people who know a thing or two about dementia have to stick their neck above the parapet, even if they’re deliberately excluded from conferences or undermined by people with long titles. My gut instinct is that we will get to know whether as a society whether it’s possible to ‘half believe’ in dementia friendliness by the actual behaviour of society. This will be very difficult to ascertain, but we will need to look into this. One thing’s for sure, it won’t be easily determined by the abundance of stickers promoting ‘awareness’. “It is better to stand in the dark with a friend, than stand alone in the light” Helen Keller",
				"Author":"Nigel Hullah",
				"URL":"https://dementiadiaries.org/entry/6409/it-is-better-to-stand-in-the-dark-with-a-friend-than-stand-alone-in-the-light"
			}				
		]
}
{
"Coping": [
			{
				"Tip":"Getting a dog as a companion can give you something to live for because you're taking care of something.",	
				"FullPost":"Hello it’s Melvyn, back again. I think I’m going to start from the beginning really because, uh, it would be appropriate, wouldn’t it? Well, it started with my wife Jan. My Tally was really upset because he used to be with her all the time and she used to come in and he cuddled her. They got on ever so well. He was such a gentleman. And when my wife died he was crying so much. So, I consulted my daughter Victoria and said to her I’ll get another dog. And um, she thought it was a good idea so, um, I phoned the kennels up where I got Tally from and said um, “Have you got a dog there for Tally?”. He said “Well, I’ve got a match made in heaven for you so bring Tally down to me and we can go from there.” So I took Tally down on the Wednesday and eh, they got on ever so well. They loved one another, I could see Tally was really up for it. So I went and picked her up on the Sunday. But um, he told me that – Bonny is her name- had been with an older person, an old person, and he died about 7 months ago, 8 months ago. And um, so, I just, he’d gone back to the family so when they were looking after her, in November when all the fireworks were going off it was too much for her and she messed in doors. So they took her back to the kennels. So I’ve ended up with her and consequently, she’s a fantastic dog. She’s 8 years old and I love her dearly. Bonny her name is. Bonny Fairfield is her racing name. She’s a bonny lass. She really is a fantastic dog like my Tally. There’s some fireworks going on just now so she’s gone into the bedroom. So hopefully she’s going to come out now and i’ll give her all my love. I’ve had her a month now. It goes quickly doesn’t it? I just thought I’d like to tell you that because um, because I told you about Max. I’ve got two dogs now. I’ve got Tally, he’s a really big greyhound. Fantastically big, ginormous in fact. And Bonny is petite and cuddly and she does love a cuddle. So Tally is next to me now, he’s having a cuddle. So, yeah that’s keeping me a bit busy. Taking them out, looking after them, that’s occupying me. Because I don’t like being out for too long, but um, like I said I’ve got to fill my life up. And I’d rather do more for DEEP if I possibly could. I’ll wait and see. Thank you very much, and I am going to go now! Bye!",
				"Author":"Melvyn Brooks",
				"URL":"https://dementiadiaries.org/entry/6557/melvyn-shares-the-joy-and-the-comfort-of-his-two-dogs-tally-and-bonny"
			},
			{
				"Tip":"Peer support groups can make all of the difference in a person with dementias life. ",	
				"FullPost":"Dory hopes for more peer support for 2018 and talks about how much it has helped her and others Hi, this is Dory and it’s quite early in the morning, but I thought before I start the day I’d like to express what my hopes for this year, 2018 will be. I’m hoping to get more peer support in Flincher. I have my peer support with DEEP and the Old Brewery, so I want to push, get DEEP more heard about in Flincher. I have already got peer support like the Friendly Face, our new DEEP group at the Plough. So its very slow at the minute, but we have our first of 2018 social group at the Plough, so I’m hoping some more people will start joining in with that. I know it’s made a big difference to me, the peer support, mostly through DEEP and all you lovely people that I meet and I hope I can do more with DEEP this year because it helps me as well as helping other people. A gentleman who comes to the resource centre and he’s just been coming a couple of months. I think he has Parkinson’s and Lewy Bodies. Before Christmas the centre closed for Christmas. I wishes him a Merry Christmas and he gave me a hug and said what a difference I had made to him since he’d been coming to the Old Brewery and he said it was my positivity, that he loves listening to me telling him about DEEP is doing and he’s always asking me had I been away doing any talks with DEEP and what I’d been up to. I felt really humbled and that is what I think it’s what it’s about, just to help just one person. And I thought even if it takes a long time to get peer support up and more popular in the area I live. So that’s two people with the phone call I got from Friendly Face and this gentleman. I would like him to come to our social group. I do have my peer support at the Old Brewery. That’s my hope for this year. Happy New Year, Bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6589/dory-hopes-for-more-peer-support-for-2018-and-talks-about-how-much-it-has-helped-her-and-others"
			},
			{
				"Tip":"Inviting someone else with dementia into a support group can change their life for good. ",	
				"FullPost":"Dory hopes for more peer support for 2018 and talks about how much it has helped her and others Hi, this is Dory and it’s quite early in the morning, but I thought before I start the day I’d like to express what my hopes for this year, 2018 will be. I’m hoping to get more peer support in Flincher. I have my peer support with DEEP and the Old Brewery, so I want to push, get DEEP more heard about in Flincher. I have already got peer support like the Friendly Face, our new DEEP group at the Plough. So its very slow at the minute, but we have our first of 2018 social group at the Plough, so I’m hoping some more people will start joining in with that. I know it’s made a big difference to me, the peer support, mostly through DEEP and all you lovely people that I meet and I hope I can do more with DEEP this year because it helps me as well as helping other people. A gentleman who comes to the resource centre and he’s just been coming a couple of months. I think he has Parkinson’s and Lewy Bodies. Before Christmas the centre closed for Christmas. I wishes him a Merry Christmas and he gave me a hug and said what a difference I had made to him since he’d been coming to the Old Brewery and he said it was my positivity, that he loves listening to me telling him about DEEP is doing and he’s always asking me had I been away doing any talks with DEEP and what I’d been up to. I felt really humbled and that is what I think it’s what it’s about, just to help just one person. And I thought even if it takes a long time to get peer support up and more popular in the area I live. So that’s two people with the phone call I got from Friendly Face and this gentleman. I would like him to come to our social group. I do have my peer support at the Old Brewery. That’s my hope for this year. Happy New Year, Bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6589/dory-hopes-for-more-peer-support-for-2018-and-talks-about-how-much-it-has-helped-her-and-others"
			},
			{
				"Tip":"Everyone with dementia is different and should cope with their symptoms in different ways. ",	
				"FullPost":"Hello it’s Tracey, hope you’re ok, I want to talk about music really. I used to love listening to music, absolutely love it and stuff. If I used to drive to work or anywhere, a CD used to go in, all the time music as background at home and all that sort ofmalarky. Unfortunately I don’t, I can’t. Music even noise irritates my brain, my dementia. So I like complete and utter silence most of the time. It’s easier for my brain to have that and I do get fed up with listening to people saying what I should be doing when actually we all know that dementia is individual to that person unless they’re right and they go wrong. I don’t have background noise now; I have complete and utter silence. Most of the time because I’m so busy if I am busy being with people for a couple of hours and then I need the break of complete silence. I might be doing something or whatever but I can’t have background noise any more. I do like listening to music I’ve still got CD’s and I have Spotify on my phone which I’ve never had before, that’s quite nice. I was in my conservatory yesterday and had my Spotify on my phone going very softly in the background; I coped with that quite well. It wasn’t too much noise and I was focusing on something else but most of the time I have to have a lot of silence in the background. I know people don’t understand that, they think it helps the brain and you have to listen to it all the time. Well I don’t have to do anything, I don’t think nobody does. I just wish people would remember that we’re all different. I put something on Twitter about music and some people came back and said well you have to do this and you have to do that. I said no I don’t have to do anything because we’re all different with our perception of things and I just think they need to be aware maybe of how we are maybe and how dementia affects us in different ways. Anyway, hope you have a good day. Bye now!",
				"Author":"Tracey Shorthouse",
				"URL":"https://dementiadiaries.org/entry/6598/tracey-used-to-love-listening-to-music-but-now-finds-that-it-irritates-her-brain"
			},
			{
				"Tip":"You have to come to terms with how you will lose things",	
				"FullPost":"Hello this is Shelagh Robinson. I’m being bothered this morning by the puttie-downers. I don’t know if anybody else gets them, they are a bit like the borrowers except they only live in the homes of people who have dementia. So this is what happens, you find something you’ve been looking for for ages and you say, “oh that’s where it is” and then you put it down, and they take it away again. So as soon as you put it down you lose it. Do you have the puttie-downers? I’ve got them this morning.",
				"Author":"Shelagh Robinson",
				"URL":"https://dementiadiaries.org/entry/6624/shealgh-asks-does-anyone-else-have-visits-from-the-borrowers"
			},
			{
				"Tip":"We need hope for the future and the way to realize that is through supporting research",	
				"FullPost":"Imagine a world without dementia Imagine how wonderful that would be Imagine never having to go through the trauma of a diagnosis Imagine never having to see a loved one forget who you are Imagine never having to live with the fear of dementia coming into your life Sadly ‘imagine’ Is all we can do right now. But through research that thought may become a reality. We can’t change the future without research. ‘Hope’ is what keeps those of us already diagnosed, going. Be part of the gift of Hope – sign up to Join Dementia Research and let’s give Hope a chance. If you don’t think research affects you, you may change your mind if you or someone close to you was given that devastating diagnosis of dementia.",
				"Author":"Wendy Mitchell",
				"URL":"https://dementiadiaries.org/entry/6631/wendy-imagine-a-world-without-dementia"
			},
			{
				"Tip":"Dementia shows that we cannot take our lives for granted, and People Living With Dementia have to construct new lives after their diagnosis. It is a process and a struggle that takes a lot of practice and hard work to make better",	
				"FullPost":"Two of my peers were both sectioned over the Christmas period and having visited them I wondered What dementia teaches us We all take our brains for granted and its not until something goes wrong with it that we fully appreciate it. A diagnosis of dementia will show you exactly who your true friends are Time and the inability to hang on to memories have a way of erasing what once seemed so important but the heart remembers long after the mind forgets No matter how much money you have material possessions are not what matters in the end. Nothing’s for sure, including those close relationships we take for granted. Loved ones upon whom we may have counted for comfort in our old days, those people may die on us or have a change of heart Our carefully constructed identity is just a story with a beginning, middle and end. For my Peers and myself that story will end way before our final years,that’s why we need new ways of occupying ourselves, right here, right now. You can not argue with Person Living With Dementia, you will not make them change their mind. If the PLWD believes they are right then they are right. If they believe their mum/dad is alive then ‘they are’ Don’t take it personally if the PLWD does not remember, but more importantly do not press a PLWD to try an remember. If you want to communicate with us then You have to enter our world and that could be any place in time. You can help us make new memories maybe ones we won’t remember but ones we feel. Remember That we have good and bad days and that the simplest way is sometimes the best way to get anything done in life. when you’ve met one person with dementia you’ve met one person. Your memory loss is not who you are. Dementia is non-discriminatory, Dementia can affect anyone regardless of Wealth, gender, race, colour, or creed You don’t need to have all the answers! No one expects you to become a dementia expert overnight. With dementia can come new challenges, and you might not always have the solution There are still the majority of people out there who believe that people with dementia can’t communicate, can’t understand or won’t make sense. We may have dementia, but this does not make us stupid – or deaf! But more importantly we will be heard",
				"Author":"Tommy Dunne",
				"URL":"https://dementiadiaries.org/entry/6641/two-of-my-peers-were-both-sectioned-over-the-christmas-period-and-having-visited-them-i-wondered-what-dementia-teaches-us"
			},
			{
				"Tip":"Community and assistance in feeling like you are included can be a huge help ",	
				"FullPost":"Hi everyone, it’s Agnes from Scotland. Well today was my first knit meet up, the first of this year. I’ve been going to this class for over 4 years now. I was so moved today that one of my fellow stitchers and bitchers had listened to how I had been struggling to remember names. So she gave me a specially made members’ list with photos and names beside them. This will be so helpful. It will make me feel more included in the class. It’s so nice for people to call me by my name and it’ll be so nice to be able to call their name back. How thoughtful was this? I feel so grateful to have found such a welcoming, inclusive group. They knit, they sew, they chat, they laugh. We share what is going on in the community, what’s happening, getting up to date. This has been so good for me. Sometimes I can’t knit due to my visual impairment but they have helped me so much. And anyway I can just go and listen, help make the tea, just feel included. I just thought I’d share this with you. I hope you’re all having a wonderful day. I know I did. Bye for now.",
				"Author":"Agnes Houston",
				"URL":"https://dementiadiaries.org/entry/6644/agnes-is-grateful-for-the-efforts-taken-to-make-her-feel-included"
			},
			{
				"Tip":"You have to be strong when dealing with dementia and often, because of dementia, you will not have that strength",	
				"FullPost":"Good morning, this is Shelagh Robinson. There seems to be no end to the losses of dementia, and one of the things I am very conscious of losing because I am in the middle of this at the moment is resilience. Through all my life I have been a very resilient person, I have had to be, a young widow bringing up three children. But, earlier this week at a meeting and someone lost it with me and it was a very unpleasant confrontation which I truly think I didn’t deserve but days later I am still not coping with it. I had an email from the person involved and I couldn’t open it and then went into the bathroom and was sick, just at the contact and it left me not sure whether I can continue working in this group or with this person or not, and knowing, I think knowing that this isn’t me, this is the dementia and it frightens me because just because you have dementia doesn’t mean you won’t be faced with difficult situations. And if you can’t cope with them and clearly I can’t cope with them in the way I used to, what does that say about the way I can continue living my active life if I am going to be such a snowflake and just fall apart if someone loses it with me. They may well have their own reasons for doing so, now I’ve always been able to go underneath and see what was happening and I’m just not doing it and it’s one more thing that frightens me. Thank you.",
				"Author":"Shelagh Robinson",
				"URL":"https://dementiadiaries.org/entry/6731/shelagh-feels-less-resiliant-one-more-thing-that-frightens-me"
			},
			{
				"Tip":"Support groups can help you find assistance you did not know you had access to",	
				"FullPost":"Dory highlights the benefit of peer support in sharing information that you might not be told or know about Hi, This is Dory. To file a few thoughts on another benefit of having peer support is that you get to find out about things that you may be entitled to and not told about. One of my peers recently told me about Direct Payments, which, I’ve joined a Gym simply because, well, not simply because, I want to get a bit fitter but I’d lost my appetite due to my dementia and since I’ve been going the Gym, my appetite’s come back. And it’s also, when I’m not around doing talks and raising awareness and talks for DEEP and other things I get quite down just being stuck in the house. This Gym is just across the road from me and it’s a very quiet Gym and I’ve been struggling to pay the monthly thing but because it does me so much good I’ve been paying it and then as I said a peer friend told me about Direct Payments and so she actually looked into it for me and I’ve just had a phone call to say it’s going to be paid for me by Direct Payments for my well being, so apart from all the support and the social side of things of support, it’s actually very good for information. OK, just thought I’d share that with you. Bye!",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6734/dory-highlights-the-benefit-of-peer-support-in-sharing-information-that-you-might-not-be-told-or-know-about"
			},
			{
				"Tip":"Building community is helpful",	
				"FullPost":"Hi this is John, I’m currently at a Dementia Diaries meeting in Belfast, which is great. We have a lot of our members here today, which gives me great heart to see these people around this table here. It’s wonderful.",
				"Author":"John McErlane",
				"URL":"https://dementiadiaries.org/entry/6783/john-says-belfast-calling-with-a-visit-from-philly-about-dementia-diaries"
			},
			{
				"Tip":"Producing art can be a coping mechanism",
				"FullPost":"If only we could? Remember remember if only we could The things that we did or we thought we did A memory flashes into our brain and causes happiness or even pain Why has this happened so quick thought Remember it before is vanishes as quick as it came But don’t worry there’ll be more much the same But what if there’s not and they’re all forgot What will we do Life is too short to forget Try to remember The memories that made us smile a lot Even the memories that made us so sad You will remember and you will be glad Remember remember you know you should Remember remember if only you could",
				"Author":"Steve Clifford",
				"URL":"https://dementiadiaries.org/entry/6871/steve-says-you-will-remember-and-you-will-be-glad-remember-remember-you-know-you-should-remember-remember-if-only-you-could"
			},
			{
				"Tip":"Producing art can be a coping mechanism",	
				"FullPost":"Memories Should I tell he truth?? A few weeks ago my grandson came home from school and asked me if he should always tell the truth. I said its always best to, and asked him why he asked the question. He told me in class that day the teacher had asked eveyrone what their favorite animal was. Most of the other kids chose many zoo animals, when it came to his turn he said, Fried chicken. The teacher went mad and sent him to the naughty corner. After a while she asked again saying what is everbodys favorite live animal. My grandson said, chicken. The teacher asked why he had chosen chicken and he said because you can make it into fried chicken. She sent him again to the naughty corner. She continued then asking everyone who was their favorite person, most of the class said pop stars film stars or tv personalities. My grandson said Colonel Sanders He spent some time in the naughty corner and couldnt understand why He was telling the truth. The truth is not always visible to everyone is it.",
				"Author":"Steve Clifford",
				"URL":"https://dementiadiaries.org/entry/6874/steve-memories-should-i-tell-the-truth"
			}
		]
}
{
"Life Advice": [
			{
				"Tip":"Don't be afraid to share embarressing moments in your life",	
				"FullPost":"Hi, this is Dory and this is the second day of Christmas of my silly stories, actually these are embarrassing stories and they’re two very short ones. And the first one is, it is a bit embarrassing really for me to say. When I first started my periods I was 16, quite a late starter and I first started while I was at work and you couldn’t go into a supermarket in them days and just buy them off the shelf. So I went into the chemist and asked for a box of tampoons. So there’s my first embarrassing story. And the second one was when I was younger than that, my Taid used to roll his own cigarettes and he used to smoke Golden Virginia, and he sent me to the shop, because they used to sell to under 16s then, to get him half an ounce of Golden Virginia. But I went into the shop and I asked for half an ounce of Golden Vagina. So there are two little embarrassing stories, I’m sorry about the subject, it is quite embarrassing. I’ve had a busy day, we’ve had Christmas dinner at the Old Brewery which was quite eventful to say the least but great fun. So I thought of them two little stories, so I thought they might make you smile. Day 3 tomorrow won’t be so embarrassing though I do have quite a lot of embarrassing moments as I’m sure we all do anyway. I think I have more than most. Ok, speak to you tomorrow, bye.",
				"Author":"Dory",
                "URL":"https://dementiadiaries.org/entry/6433/dorys-silly-story-number-two-2-for-the-price-of-1-here-folks"
			},
			{
				"Tip":"Make many memories in life because they are the most important thing.",	
				"FullPost":"Hello, this is Peter Berry here. I just wanted to wish all my fellow diarists and everyone who listens to Dementia Diaries a very Merry Christmas and a Happy New Year. And most importantly, make lots of memories in the process cos that is the most important thing. Bye!",
				"Author":"Peter Berry",
				"URL":"https://dementiadiaries.org/entry/6439/peter-wishes-everybody-a-happy-christmas-and-make-lots-of-memories"
			},
			{
				"Tip":"Share the memories you've made, even the embarressing ones.",	
				"FullPost":"Hi, This is Dory and this is the 3rd installment of my silly stories up to Christmas. I’m glad you all seem to be enjoying them anyway. This one is, I think Agnes will quite like this one. When I was with my ex-partner again, years ago, I was going to visit the friends from Scotland, the ones from the other night’s story. And I was going on the coach and I said to my partner who wasn’t coming with me what would he like for me to bring him back? So he said to bring him back a haggis. Now, I know that you eat a haggis but I didn’t know what it was actually made of. So I said to him ” Well, do you think I’d be able to get one in the supermarket? ” So he said, ” Well, you’d be better going to the butchers and ask for a low flying one because they’re more tender.” So I said “Oh, is it a bird is it, a haggis?” Yes, he said but you get those that fly higher and those that fly lower so ask for a lower flying one” Now I know ….you’re probably all thinking god, she’s thick to believe that but I was very gullible and I believed anything anybody told me and as I didn’t know what was a haggis I thought maybe he’s right. So I was on the coach and it was picking up people along the way and a lady got on and asked could she sit next to me. She was from Scotland, she’d been to visit family. So we were talking away and I said that my boyfriend had asked me to get him a haggis I said, and he said to make sure it’s a low flying one. Well, she nearly choked on her drink and said ” Eh I think someone’s having you on hen” and then went onto explain about the haggis. So, I just think it’s a good job I met that lady because, otherwise I’d have gone into the butchers and asked for a low flying haggis and made a proper fool of myself. So I think….Oh my phones ringing now. Next installment tomorrow. Ok, Bye, bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6442/dorys-christmas-silly-story-number-three-we-know-you-have-been-waiting-with-baited-breath"
			},
			{
				"Tip":"Enjoy the memories that you can still remember.",	
				"FullPost":"Hi, this is Dory and we’re on day 6 of the silly stories in the lead up to Christmas. So only one more to go you’ll all be pleased to know. This one’s only a short one. When my daughter was getting married it was sort of lateish afternoon so we were having a buffet at night after the service. So because it was late on we thought we’d go straight to the hotel after the church and just have something light to see us all onto the buffet. So I was talking to my neighbour about the wedding and she was saying “what are you having to eat? Are you having a buffet or a sit down meal?” And I said we’re having a buffet in the evening but because of the times we’re just going to have a few light bites when we get there. We’re just going to have some bowls of chips out just to nibble on and some canapes or hor divorce. She burst out laughing and explained it’s canapés and hors d’oeuvres. So when I see it written I still think hor divorce. So that’s just a short story and just one more tomorrow. I’ll try and wrack my brains to remember a good one as I say there’s that many I’ve forgotten half of them. Ok then, bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6492/dorys-6th-silly-christmas-story-involving-canapes"
			},
			{
				"Tip":"Some people can actually be better with dementia.",	
				"FullPost":"Hi this is Dory and this is the 7th silly story and it’s 2 for 1 again and this will be the last one. Thank god, I know you’re all saying. Here we go, years ago I spent some time after a bad accident in a spinal ward and we were all, you know, well I had a broken neck and we were all broken necks and broken backs, but we used to have some fun. Well we’d have a laugh, so we were all lying flat on these beds and there was a lady in the bed next to me from Scotland and she used to have sort of midnight feasts and count her money. So you’d hear this rustling every night while she was chomping away and counting her money. Anyway the nurses came round in the morning to give us bed baths and I could hear some giggling going on. So I said to the nurse “is everything ok?” They said that when they turned Josephine they found, she had after eight mints and a £20 note stuck to her bottom. So that was that little story. And the 2nd story involving the same lady, she was put in a body brace and she was allowed to get into a wheelchair. There was big patio doors that opened on one side of the ward. So she went outside to have a smoke so she sat just outside the door in her wheelchair to have a smoke. Well I was still having to stay flat on the bed, and we had these special mirrors that hung down from the ceiling so I could see without moving my head, sort of what was going on. I could see Josie and I could see her waving her arms around and I thought she was waving to me so I was sort of put my hands up to wave back and then there was a bit of commotion and what had actually happened was that the end of her cigarette had fallen off and landed in her slipper and her slipper was on fire. She was waving her arms to get attention and I was waving hello. So that’s that story. Anyway, I hope you’ve enjoyed them, these all happened before I had dementia so I think I’m better now with dementia than I was before. Anyway I hope you all have a lovely Christmas and enjoyable and peaceful. I’ll give you all a rest from me now. And hope to see you all through the year, next year. Ok, Bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6496/dorys-7th-and-final-silly-christmas-story"
			},
			{
				"Tip":"Enjoy the minute details of life because that is what really gives meaning",	
				"FullPost":"Hi, It’s George here on Christmas day, I’m just erm saying Happy Christmas to everybody, I’m actually walking the dog around [inaudible], my local well beauty spot come [inaudible]. I , erm I had a quiet Christmas, seeming my family aren’t coming back until Tuesday or Wednesday. Wednesday I think. Um, interesting thing happened to me, I found, I was looking in a second hand bookshop for presents for people and I found a book about [inaudible] about [inaudible] and his huge long work remembering things past. The interesting thing is, there is a little bit I’ve read about looking at the detail. Seeing the detail, the minute detail in life. And that’s really, sort of, hit a chord with me. Think it is really important for us, to look at the details around us, and look around life as it passes by, and I’ve been looking here, sitting here on a bench at [inaudible], the gale blowing which you can probably hear. There is lots and lots of tiny details, including my dog Lupin who just joined me to give me a great big slurp on my face . Anyway, yeah, keep your eyes open, keep present and enjoy the details. Enjoy the minute details of life because that is what really gives meaning. Have a good Christmas, and speak to you again soon. Bye",
				"Author":"George Rook",
				"URL":"https://dementiadiaries.org/entry/6534/george-says-keep-you-eyes-open-see-the-minute-detail-in-life"
			},
			{
				"Tip":"Be Hopeful about the last stages of dementia. ",
				"FullPost":"Hello, this is Shelagh Robinson. I’ve at long last found a book I’ve been looking for for years, which I’ve tried to remember and now I have and I just hope it’s true: ‘All nature grows in the dark and it is Gods providence which ordains who it is who needs that darkness of mind and sense in which the spirit can fulfill its final consummation. ‘We do not know at what perception they are inwardly gazing, who endure this strange state of dementia’. I don’t know if its true. I’m not at that long slow decline yet, but oh, I hope it is.",
				"Author":"Shelagh Robinson",
				"URL":"https://dementiadiaries.org/entry/6489/shelagh-shares-a-quote-she-has-been-looking-for-for-a-long-time-all-nature-grows-in-the-dark"
			},
			{
				"Tip":"Don't be afraid to confide in strangers, sometimes strangers can become friends when you share a bit of your story with them. ",	
				"FullPost":"Melvyn talks about the comfort of strangers Hello it’s Melvyn, um, it’s Thursday, it’s Thursday what are we..28th. I been in the erm depression um and also um I’ve met – I’ve met people that um have been really nice to me. I met a guy when I was out with my dogs walking. I’ve seen him before and I met him funny enough, I happened to be in town shopping, I’m talking some time ago probably over a year ago and he very often used to be outside sitting there with his dog. He got a young dog, a young puppy and we got talking then and he seemed a really really nice guy; he’s got mental problems he’s got um.. but also, unbeknown to me, a year ago his father had a stroke, he was 86, and um he said that his father was really, up until that point, his father was really active – you know, played golf a couple of times a day, went shopping, and you know, always on the go. For him to be how he is now, he said he’s paralysed down one side, and he’s still in hospital and being fed, and um, that was unbeknown to me, you know I’ve learnt this since my wife has died and I met him the day when I was out with my dogs and we got chatting and I just broke down and cried. You know what I’m like, I’m very emotional and he put his arm around me and just said what’s the matter, and I told him and then he told me about his father and since then I’ve met him a couple of times out with the dog, and we’ve had a cuddle – put our arms around one another and you don’t know how much that meant to me because he’s such a nice person. Funny enough he lives in the road me and my wife used to live in – he lives in number 78 where we used to live in 71 so we was the opposite side of the road to him. But he said you know, anytime you feel like coming round, come round, or give me a tinkle and we’ll have a chat. But I haven’t done, because I don’t want to put any pressure on him because of his father – it’s horrible having to see your father like that I can remember once, being out side of the café with his father so, yeah. My son came over Christmas eve, my son Gregory and stayed with me Christmas day and went back boxing day because he lives with my daughter Victoria.",
				"Author":"Melvyn Brooks",
				"URL":"https://dementiadiaries.org/entry/6550/melvyn-talks-about-the-comfort-of-strangers"
			},
			{
				"Tip":"Be grateful for the time that you have with your loved ones.",	
				"FullPost":"Hello it’s Melvyn here. It is now half past 11 at night and I want you to listen to this……………………….. did you hear it? Silence. That’s what’s in my house, without my darling wife. So (???). I cannot hear her cannot breath her cannot smell her cannot touch her. I will not ever see her again. I have loved her. I have caressed her. And I am happy that I did. I am privileged to have known her. Privileged to have married her. And to have looked after her. I don’t know how long it’s going to be before before I can express my love and I don’t know. My Alzheimer’s is getting worse. My dementia’s getting worse. All what it must’be been like for my wife, knowing that my brain is going and how she would’ve coped with it. So perhaps in that instance it’s better that this way. Because she hasn’t got the pain of me maybe the pain of her disabilities. (???) 2018 in (???) so let’s hope it’s a better 2018 and let’s hope we find a cure for dementia and start to be able to enjoy that thought. I’m here on the settee with my dogs by the fire, aren’t we? (???) so that so perhaps we should all be lucky or perhaps I should be lucky for just for that. Who knows? Who cares? No love, no compassion, no care.",
				"Author":"Melvyn Brooks",
				"URL":"https://dementiadiaries.org/entry/6553/melvyn-it-is-half-past-11-at-night-and-i-want-you-to-listen-to-this-silence"
			},
			{
				"Tip":"Doing good for others makes you feel good.",	
				"FullPost":"Hello! This is Peter Berry here! I just wanted to call the diaries today just to talk a little bit about having a sense of purpose, a sense of achievement. And I think that’s very important for people like me – with Alzheimer’s – to have something to strive forward for. About 7 months ago I started doing weekly videos that I put on Facebook and on youtube. All about living with Alzheimer’s and what it’s like to live with Alzheimer’s – from my perspective. And the idea was to, in the beginning, do one or two videos, maybe 4 maximum, just to help people to understand a little more about dementia and Alzheimer’s. From the inside out, as it was. But as time progressed people got to listen to the videos more and more and I got more followers and so many wonderful comments. And one thing that I never realised was that after over 7 months of doing these videos – was that my whole idea was to help others, but in actual fact it helps me. It gives me a sense of purpose and something to focus on. Every Friday I put the videos up at about 8 o’clock in the morning and my daughter helps me to do that. And it’s just a documentary of helping my life with this condition. But it seems to have done some much good for so many people and it has the affect of helping me, i’m sure it has helped me to remain positive and give me a sense of direction, which is so important. And I just think that anybody out there that has this condition, and I know many people do do lots of great things , but there are those that don’t. And I just think that having a sense of achievement and responsibility is better than just about any medication. So really I just wanted to make that point that doing things for others does make you feel good, it does help. I don’t know – it helps oil the cogs I suppose. Have a great day and hopefully I shall to to you all very soon. Thank you so much for listening.",
				"Author":"Peter Berry",
				"URL":"https://dementiadiaries.org/entry/6577/peter-talking-about-a-sense-of-purpose-and-having-something-to-strive-forward-for"
			},
			{
				"Tip":"Having a sense of achievement and responsibility is better than just about any medication. ",	
				"FullPost":"Hello! This is Peter Berry here! I just wanted to call the diaries today just to talk a little bit about having a sense of purpose, a sense of achievement. And I think that’s very important for people like me – with Alzheimer’s – to have something to strive forward for. About 7 months ago I started doing weekly videos that I put on Facebook and on youtube. All about living with Alzheimer’s and what it’s like to live with Alzheimer’s – from my perspective. And the idea was to, in the beginning, do one or two videos, maybe 4 maximum, just to help people to understand a little more about dementia and Alzheimer’s. From the inside out, as it was. But as time progressed people got to listen to the videos more and more and I got more followers and so many wonderful comments. And one thing that I never realised was that after over 7 months of doing these videos – was that my whole idea was to help others, but in actual fact it helps me. It gives me a sense of purpose and something to focus on. Every Friday I put the videos up at about 8 o’clock in the morning and my daughter helps me to do that. And it’s just a documentary of helping my life with this condition. But it seems to have done some much good for so many people and it has the affect of helping me, i’m sure it has helped me to remain positive and give me a sense of direction, which is so important. And I just think that anybody out there that has this condition, and I know many people do do lots of great things , but there are those that don’t. And I just think that having a sense of achievement and responsibility is better than just about any medication. So really I just wanted to make that point that doing things for others does make you feel good, it does help. I don’t know – it helps oil the cogs I suppose. Have a great day and hopefully I shall to to you all very soon. Thank you so much for listening.",
				"Author":"Peter Berry",
				"URL":"https://dementiadiaries.org/entry/6577/peter-talking-about-a-sense-of-purpose-and-having-something-to-strive-forward-for"
			},
			{
				"Tip":"Helping people can also help yourself and it is important to create a community that will help people with dementia",	
				"FullPost":"Annie Says “Hooray for Dementia Friends” Annie here. Well how come when you’re having a bad day and all you want to do is give up, something comes along and makes you realise that that’s not an option. Today I intended to stay in bed but then the phone rang and I found myself throwing some clothes on and zipping along to my hair salon. A lady with dementia needed some help and because the staff at the salon had done their Dementia Friends Awareness they felt confident to phone me rather than the police. It goes to show that making our communities dementia friendly is so important. Plus the fact I had a reason to get out of bed and out of my depressive stay. Hooray for Dementia Friends. Thank you.",
				"Author":"Annie",
				"URL":"https://dementiadiaries.org/entry/6728/annie-says-hooray-for-dementia-friends"
			},
			{
				"Tip":"Living with dementia is a constant fight that support groups and routine can help you deal with",	
				"FullPost":"Melvyn – catch up and Buddy Scheme Hello it’s Melvyn here. It’s been quite a while since I’ve done the last diary so getting back on stream with dementia and started going back to Forget Me Nots a couple of weeks ago. I said thank you to all the Forget Me Nots who phoned me. I just said to them I didn’t write a letter but I just wanted to say thank you and how thankful I was for their help over the last couple of months. We’re creating a Buddy Scheme in Kent, in Canterbury where I live, and I’ve got back on stream with that. I missed one meeting, since my wife died, I was pretty keen to get back into that as it sounds like a very good scheme. It’s about giving information to people newly diagnosed with dementia. The Buddy Scheme is for people if they want someone with dementia to to speak, to get them on the right road to give them information which is useful to them. Because when you’re first diagnosed it’s a horrendous time, it’s horrendous all the time, but we are going to strive to help these people. We are creating a framework for us to work to. Like with everything we have to have rules and regulations. And also I was looking at some of the leaflets that I pick up and I’d like them to define “living well with dementia”. Because since I’ve been diagnosed I’ve never lived well with dementia, I fight it, and I fight the outcome, but I don’t ever live well with dementia and I don’t think anyone does. I’d like to know who actually put this together, it’s got to be an academic, otherwise it wouldn’t be there. I’d like to shoot that down, because you don’t live well with dementia. I’ve had this argument before and I’d like to define that word as well “living well with dementia” I’d like some correspondence from this please and we’ll go from there. I’ve still got my dogs, my darling Tally and Bonny and I’ve got back to doing my exercise, however it’s so hard, it doesn’t get easier, it just gets better. It doesn’t get better, but it does get easier. I don’t know which way round that goes. Someone asked me the other day when I was up the gym, ” Does it get easier, or does it get better?”. I had to laugh. No never mind, I’m going to finish now and I’d like to be doing something, a project, I don’t know, if DEEP have got one out there for me, I’d really like to do it, and we’ll go from there.",
				"Author":"Melvyn Brooks",
				"URL":"https://dementiadiaries.org/entry/6761/melvyns-catch-up-and-how-they-are-setting-up-a-buddy-scheme"
			},
			{
				"Tip":"Phone calls can be a easy method of assistance",	
				"FullPost":"Good Morning, it’s Agnes from Scotland here. I’m still getting over this flu. What I wanted to talk to about was Teresa Davies great fridge magnet. A friendly face. I was thinking that while I was in bed the last ten days with the flu, sometimes just that friendly phone call “Hello, Agnes, how are you? Is there anything I can do for you?” made all the difference. I didn’t get many of these nice, friendly phone calls so that’s why I loved these magnets. Great idea, yes it’s good to chat, it’s good to get a friendly face and sometimes it doesn’t take very much for a phone call Bye.",
				"Author":"Agnes Houston",
				"URL":"https://dementiadiaries.org/entry/6774/agnes-likes-the-idea-of-a-friendly-face-especially-when-she-was-in-bed-with-flu"
			},
			{
				"Tip":"Life is hard work and that does not change with a diagnosis",	
				"FullPost":"Hello, it’s Melvyn here. I was sitting here on my settee, looking out of my bay window and I was reminiscing from when I was younger. To be honest it’s was no different now than it was 40 years ago when me and my wife were working our butts off to pay the mortgage. And I can remember when I first got my house which was big old 3 or 4 bedroom Victorian house and the interest rate was 8.5% when I got the mortgage. And then the interest rates kept going up, going up and ended up at 17.5%. As you can imagine going from 8.5% to 17.5% in just over 2 years, it was a horrendous time because we hadn’t budgetted for our mortgage to go that high. But we managed to keep paying the mortgage. I don’t know how but I was able to do a lot of overtime, my wife Janet was working, she didn’t have a bike, so I got her a bike. So when I was at work she would do the shopping, she would go down to Tescos or wherever. And there was a seat on the back for my son Simon, and then we had my daughter. So my wife had two children to cart along, as well as the shopping, I don’t know how she did it. We had four dogs as well. I don’t know how we managed with that. We were rushing about here there and everywhere, like they are today, no different. They think they are so hard done by. But it is a harder place to live, but no different, we still had nasty politicians trying to upset you, more so today and I see people dashing about and it was no different than 40 years ago. I can remember getting up at 5am to be at work for 6am, going home at 8pm or 9pm sometimes. Just to pay the mortgage and to feed the family. Even in those days we had an account together, we wouldn’t have survived, we always used to share, whatever went in the bank we shared. People seem more angry now, that we were 40 years ago. We still had time for social, we used to bike down to the seaside, which was about 4.5 miles away from where I lived, and that was our day out, or we would go down to the beach, it was all pebbly and wild, and it was where we used to go.",
				"Author":"Melvyn Brooks",
				"URL":"https://dementiadiaries.org/entry/6777/a-powerful-reflection-by-melvyn-of-how-life-was-for-him-and-his-family-40-years-ago"
			},
			{
				"Tip":"Creating a routine is important",	
				"FullPost":"Hi its Glenda here, we had great fun yesterday we went to play the Ukulele, I thought it was lessons of course but it’s only two sessions for two months, but it was for the children and we had absolutely great fun and they were filming, and it was on the television programme called Heno, I have put it on facebook and it’s got english subtitles. There is lots or aeroplanes going on here at the moment and I have just been out today for lunch at the Meet-Well Centre where they make lovely lunches for about four pounds, but I’ll tell you I can’t really play the ukulele it was just we had a bit of fun with the children and it was a lovely afternoon out and I’ll call again next week. I’m just watching two aeroplanes going out my house at the moment they’re making an awful lot of noise and they are just going round and round. Ok thank you bye . Can you hear them ? it’s an awful lot of noise , anyway I might meet some of you as I am going to the Llandudno in March, I might meeet some of you then. Bye .",
				"Author":"Glenda Roberts",
				"URL":"https://dementiadiaries.org/entry/6823/glenda-had-a-great-time-playing-the-ukulele-with-school-children-and-appearing-on-s4c"
			},
			{
				"Tip":"Getting out of the house and enjoying nature is important",	
				"FullPost":"Hi there , it’s George in beautiful old Shropshire . I just thought I would take this opportunity on the best day of the year probably since last summer, it’s absolutely ,stunningly, beautiful outside and it’s all the more reason for everybody to get outside into the air, into the I don’t know nature, it really is …, I have been giving talks this week to various people that live in Chester and a radio interview for local radio here . I don’t know I just sort off got into a bit and started thinking a little too much about dementia and symptoms, being out here and just looking around the fields, I feel the sun, I can hear the birds starting to sing a bit, it really does you good , thoroughly recommended it, clear your head and allow all those confused thoughts to calm down temporarily and now you’ve got peace and quiet so now you can go back home to sit down and feel relaxed, so do, its time to start getting out. good luck with your dementia if that’s what you have and I will see you soon . Bye",
				"Author":"George Rook",
				"URL":"https://dementiadiaries.org/entry/6826/george-highly-recommends-getting-out-and-about-on-the-best-day-of-the-year-so-far"
			},
			{
				"Tip":"Even people who are supposedly helping can be obstacles to overcome",	
				"FullPost":"Hi this is Dory, I’d just like to say, I was talking to a lady the other day who used to help out at one of the memory classes. She was also part of one of the dementia friendly communities but she came to see me to say that she’d finished with all the voluntary work and to take her name off the volunteering list because she was so angry and she came to tell me that during the course of one of the conversations she was having with another one of the volunteers who had said to her “I don’t think that Teresa has really got dementia, I think she puts it on”. And she also said about a few other people, that they put it on as well, or put a lot on. And this lady was so angry that she felt she needed to tell me. I was very angry, and am still angry, not so much for myself but because of the people she said about, I feel angry on their part, in their defence. It’s different from saying “oh you wouldn’t think she had dementia”, but to say that we’re putting it on. Why would you pretend to have something as horrible as this, even though we stay positive about it. She wouldn’t tell me who it was, but I said she should come and see what medication I have to take in the morning, and to see me on a bad day, and also for the other people. I don’t think that’s ignorance, I think that’s just rudeness and I don’t know the other word to call it. But I thought I would just report on that. Ok, Bye.",
				"Author":"Dory",
				"URL":"https://dementiadiaries.org/entry/6829/dory-feeling-angry-about-thoughtless-and-hurtful-comments-why-would-anybody-pretend-to-have-dementia"
			},
			{
				"Tip":"Building community can be immensely helpful",	
				"FullPost":"Agnes calling from Haddington with ten other voices too! Hi everybody, it’s Agnes calling, no not from Calbreath. Today I’m speaking from Haddington, and I’m not in my jammies, I’m fully dressed and I’m surrounded by 10-12 lovely people with dementia chatting together about what it’s like to live in Haddington with their unique rural issues. We’ve had lots of fun, we’re looking forward to a lovely tea. We’ve had the tea and they were looking for the cakes to go with the tea. And we’ve prepared ourselved really for the big event tomorrow where councillors are going to come. It’s been really great. So bye for now and I’ll catch you all later, everybody say bye. Bye!",
				"Author":"Agnes Houston",
				"URL":"https://dementiadiaries.org/entry/6848/agnes-calling-from-haddington-with-ten-other-voices-too"
			},
			{
				"Tip":"Routine is immensely important and its good to have support groups to rely upon when routine is broken",	
				"FullPost":"Carol is delighted to get back to a normal routine after Christmas and New Year Hello everybody, so at last, January is almost over. Hooray, such a long miserable month. After all the difficulties that I experienced around Christmas, you’ll be pleased to know I did have a wonderful time over the holiday period. We went to our middle son’s house for a very enjoyable Christmas Day and we were treated to lots of lovely food and drink. It was great to catch up with the grandchildren too. And on Boxing Day we went to our youngest son’s and enjoyed a second day of being very well looked after, with great food and fun, really did have a fantastic couple of days. On New Year’s Day we were invited to my sister’s along with my mum for an adults only day. The dinner was delightful and very tasty. My sister is a great cook, she has a way of adding so much flavour to her food and we certainly didn’t go hungry. In the new year we celebrated my brother in law’s 60th birthday with a party at the local village hall, more food and drink. So following on from this we had a dry couple of weeks, no alcohol. The renovations are still ongoing but we’ve made progress which is all good. Lots to do yet but no hurry. I have to say though that I am very happy indeed to get back into my normal routine and have enjoyed meeting up with my dementia colleagues at various meetings. They say routine is good for people with dementia and I now know this to be true. The disruption in the run up to Christmas was dreadful. So this month I’ve been to sign more forms at my solicitors, attended my local Dementia Cafe, had a KNPT NHS envoy meeting, a Forget Me Nots meeting, a SERPs Group, for those that don’t know it stands for Service User Review Panel, a Buddies meeting, another dinner at our youngest’s house, a trip to our local theatre to see the wonderful comedian Sarah Millican and a talk at a Living Together with Dementia Group. And the list goes on, a Songbird Singing Group, and yesterday a student training group to give a talk about the Tree of Life Project. Also been out for an Indian meal with hubby and family. So as you can see I’ve been quite busy throughout January and it’s been great. I’m still feeling not quite back to my normal self though as in pre-December. This does worry me a little, my memory has declined slightly and has not bounced back. I’m hoping it will, but if not well I will get used to the new me. These things happen. I must ensure I am protected from the stress this year. So that’s all for this diary, I hope to come back very soon with my next one. take care. Bye.",
				"Author":"Carol Fordyce",
				"URL":"https://dementiadiaries.org/entry/6855/carol-is-delighted-to-get-back-to-a-normal-routine-after-christmas-and-new-year"
			},
			{
				"Tip":"losing someone can be even harder when suffering from dementia",	
				"FullPost":"Hello it’s Melvyn here. it’s a bit late on a Monday night. I wrote something for Jan, shall I share it? I cannot touch her, I just put to my darling wife Jan, I cannot touch her, I cannot feel her, I cannot see her smile, I cannot hear her breath, I cannot hear her laugh, I can’t kiss her, I cannot smell her, I cannot see her love, I cannot love her anymore, I cannot see my way forward anymore, I will never see her again, I cannot hold her anymore, I cannot feel safe anymore. I’ve written quite a bit about my darling Jan and some of it is really personal and I cannot say, they’re for myself but all those out there who have loved will know what I’m getting at and how I feel and how other people have felt so devastated and when you lose your mother for argument’s sake, it’s bad. But it’s 1000 times worse when you lose your wife, who I’ve known since I was 4 years old. It was a priviledge to have known her, and to have loved her, and I miss her, her intelligence, her quaintness, her jokes, and her strength, I miss. I will never be the same person, ever. I can feel her presence everywhere I walk indoors and it doesn’t matter which room I go into, each room I go into she’s there, and that is the most difficult part about it, becuase this house is her. I built it for her and done whatever she wanted in the house for her. That’s why it’s hard. I don’t know whether I can stay here or whether I’ve got to move. I’ve been thinking about moving to France next year, and discussing it with my daughter this weekend and that’s a possibility. And I don’t know perhaps I can carry on the dementia crusade over in France, because I’m sure there’s people in France as much as in England. There’s some good news on the news about the PIP I don’t know exactly if that’s the end of it, I don’t know. I phoned Chris up from Dover and said about it to him. Chris xxx, he’s had his PIP taken away, he’s had his car taken away, he’s had his life shattered, his wife’s not well.",
				"Author":"Melvyn Brooks",
				"URL":"https://dementiadiaries.org/entry/6887/melvyn-reflecting-on-loss-and-thinking-about-the-future"
			},
			{
				"Tip":"Dementia makes life long practices and routines difficult, and you have to make new routines to fit",	
				"FullPost":"Shelagh talks about a loss around food. Compromising with ready meals going against her grain Hi this is Shelagh, Shelagh Robinson. Sometimes the losses of dementia are very surprising and I’m discovering one at the moment. I was brought up by a very traditional granny who taught me to cook everything from scratch, never to buy ready meals, to cook everything fresh. And I’ve always done that and loved cooking and it’s just not possible anymore and I’m feeling a real loss for it. I’m finding it harder and harder to cook and Paul my husband is so frail that he finds it difficult too. So we are needing, well we’re not doing yet, but it would make a lot more sense to buy ready prepared vegetables and some prepared foods and I’m really torn about doing something that I’ve never ever done and yet to know to make our lives more comfortable and less stressed it’s the only way. It’s extraordinary isn’t it, the things dementia takes away from you, that you never expect to be taken away. Love to you all, bye.",
				"Author":"Shelagh Robinson",				"URL":"https://dementiadiaries.org/entry/6897/shelagh-talks-about-a-loss-around-food-compromising-with-ready-meals-going-against-her-grain"
			}
		]		
		}